Keule/ZAI_GPS/ag-steer/src/hal_esp32/hal_impl.cpp
    // GNSS HEADING: UART2 (GPIO 19=RX, 20=TX)
    gnssHeadingSerial.begin(GNSS_BAUD_RATE, SERIAL_8N1, GNSS_HEADING_RX, GNSS_HEADING_TX);
    s_gnss_heading_pos = 0;

    hal_log("ESP32: GNSS UARTs initialised (%d baud)", GNSS_BAUD_RATE);
}

/// Read available characters from a serial and try to form a complete NMEA line.
static bool readNmeaLine(HardwareSerial& ser, char* buf, size_t max_len, size_t* pos) {
    // Limit reads per call to avoid blocking the scheduler
    int max_reads = 64;
    while (ser.available() > 0 && max_reads-- > 0) {
        int c = ser.read();
        if (c < 0) break;

        if (c == '\r') continue;  // skip CR
        if (c == '\n') {
            if (*pos > 0) {
                buf[*pos] = '\0';
                *pos = 0;
                return true;
            }
            continue;
        }

        if (*pos < max_len - 1) {
            buf[*pos++] = static_cast<char>(c);
        } else {
            // Buffer overflow - reset
            *pos = 0;
        }
    }
    return false;
}

bool hal_gnss_main_read_line(char* buf, size_t max_len) {
    bool result = readNmeaLine(gnssMainSerial, buf, max_len, &s_gnss_main_pos);
    if (result) s_gnss_main_has_data = true;
    return result;
}

bool hal_gnss_heading_read_line(char* buf, size_t max_len) {
    bool result = readNmeaLine(gnssHeadingSerial, buf, max_len, &s_gnss_heading_pos);
    if (result) s_gnss_heading_has_data = true;
    return result;
}

bool hal_gnss_main_detect(void) {
    return s_gnss_main_has_data;
}

bool hal_gnss_heading_detect(void) {
    return s_gnss_heading_has_data;
}

void hal_gnss_reset_detection(void) {
    s_gnss_main_has_data = false;
    s_gnss_heading_has_data = false;
}

// ===================================================================
// SPI Sensors / Actuator - SPI Bus 2 (FSPI / SPI2_HOST)
// ===================================================================
void hal_sensor_spi_init(void) {
    sensorSPI.begin(SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI, -1);
    hal_log("ESP32: sensor SPI initialised on FSPI/SPI2_HOST (SCK=%d MISO=%d MOSI=%d)",
            SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI);
}

void hal_sensor_spi_deinit(void) {
    sensorSPI.end();
    hal_log("ESP32: shared SPI released (FSPI peripheral free)");
}

void hal_sensor_spi_reinit(void) {
    sensorSPI.begin(SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI, -1);
    hal_log("ESP32: shared SPI re-initialised on FSPI/SPI2_HOST");
}

void hal_imu_begin(void) {
    pinMode(CS_IMU, OUTPUT);
    digitalWrite(CS_IMU, HIGH);
    // TODO: Send BNO085 reset/initialise sequence over SPI
    hal_log("ESP32: IMU begun on CS=%d (stub)", CS_IMU);
}

bool hal_imu_read(float* yaw_rate_dps, float* roll_deg) {
    // TODO: Implement BNO085 SH-2 SPI read protocol
    *yaw_rate_dps = 0.0f;
    *roll_deg = 0.0f;
    return true;
}

bool hal_imu_detect(void) {
    // BNO085 detection: read chip ID from register 0x00
    // Expected chip ID: 0x00 (BNO085 responds to SPI reset)
    // For now, verify SPI bus is responsive by attempting a transfer
    sensorSPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
    digitalWrite(CS_IMU, LOW);
    uint8_t response = sensorSPI.transfer(0x00);
    digitalWrite(CS_IMU, HIGH);
    sensorSPI.endTransaction();

    // 0xFF = floating MISO (no device pulling it down)
    // 0x00 = MISO stuck LOW (bus fault)
    // A real BNO085 would respond with its chip ID.
    bool detected = (response != 0xFF && response != 0x00);
    hal_log("ESP32: IMU detect: SPI response=0x%02X %s",
            response, detected ? "OK" : "FAIL (no device)");
    return detected;
}

// ===================================================================
// ADS1118 - 16-Bit ADC for steering angle potentiometer
// ===================================================================
// Uses libdriver/ads1118 (lib/ads1118/src/) for initialisation only.
// For runtime reads, we bypass the libdriver and read raw ADC data
// directly via SPI to avoid the "range is invalid" bug in the
// libdriver's continuous_read() (which reads back the config register
// and fails if SPI returns garbage).
//
// The libdriver is used only for:
//   - ads1118_init() — verify interface functions
//   - ads1118_set_channel/range/rate/mode — configure the chip
//   - ads1118_start_continuous_read() — start continuous conversion
//
// All subsequent reads use ads1118_read_raw() which sends 0xFF×2
// and reads back 2 bytes as a raw int16_t ADC value. No config
// register read-back, no range validation.
//
// Wiring:
//   ADS1118 DOUT  -> GPIO 15 (MISO)
//   ADS1118 DIN   -> GPIO 17 (MOSI)
//   ADS1118 SCLK  -> GPIO 16 (SCK)
//   ADS1118 CS    -> GPIO 18
//
// Calibration:
//   Raw ADC min (left stop)  -> -45°
//   Raw ADC max (right stop) -> +45°
//   Stored in NVS (Preferences) and survives reboots.
// ===================================================================

/// libdriver ADS1118 handle (used for init/config only)
static ads1118_handle_t s_ads1118_handle;

/// ADS1118 detected flag
static bool s_ads1118_detected = false;

/// Calibration state
static bool   s_calibrated = false;
static int16_t s_cal_left_raw  = 0;   // ADC value at left stop  -> -45°
static int16_t s_cal_right_raw = 0;   // ADC value at right stop -> +45°

/// NVS namespace and keys for calibration persistence
static const char* NVS_NAMESPACE = "agsteer";
static const char* NVS_KEY_CAL_VALID  = "cal_v";
static const char* NVS_KEY_CAL_LEFT   = "cal_l";
static const char* NVS_KEY_CAL_RIGHT  = "cal_r";
static constexpr uint32_t NVS_CAL_MAGIC = 0xA6511C00;  // magic to validate stored data

// --- libdriver interface functions (static, ESP32-specific) ---

/// SPI clock: 2 MHz (safe for ADS1118, matches working test script)
static constexpr uint32_t ADS1118_SPI_FREQ = 2000000;

static uint8_t ads1118_if_spi_init(void) {
    pinMode(CS_STEER_ANG, OUTPUT);
    digitalWrite(CS_STEER_ANG, HIGH);
    return 0;
}

static uint8_t ads1118_if_spi_deinit(void) {
    return 0;  // Don't deinit shared bus
}

static uint8_t ads1118_if_spi_transmit(uint8_t *tx, uint8_t *rx, uint16_t len) {
    // Deselect other SPI devices on the shared bus
    digitalWrite(CS_IMU, HIGH);
    digitalWrite(CS_ACT, HIGH);

    // ADS1118 uses SPI Mode 1 (CPOL=0, CPHA=1) per datasheet
    sensorSPI.beginTransaction(SPISettings(ADS1118_SPI_FREQ, MSBFIRST, SPI_MODE1));
    digitalWrite(CS_STEER_ANG, LOW);

    for (uint16_t i = 0; i < len; i++) {
        rx[i] = sensorSPI.transfer(tx[i]);
    }

    digitalWrite(CS_STEER_ANG, HIGH);
    sensorSPI.endTransaction();
    return 0;
}

static void ads1118_if_delay_ms(uint32_t ms) {
    delay(ms);
}

static void ads1118_if_debug_print(const char *const fmt, ...) {
    va_list args;
    va_start(args, fmt);
    char buf[256];
    std::vsnprintf(buf, sizeof(buf), fmt, args);
    va_end(args);
    Serial.print(buf);
}

// --- Direct raw ADC read (bypasses libdriver) ---

/// Read one raw 16-bit ADC sample directly via SPI.
/// Sends 0xFF×2, receives 2 bytes as big-endian int16_t.
/// This avoids the libdriver's config register read-back which can
/// trigger "range is invalid" if SPI returns garbage.
static int16_t ads1118_read_raw(void) {
    uint8_t tx[2] = {0xFF, 0xFF};
    uint8_t rx[2];
    ads1118_if_spi_transmit(tx, rx, 2);
    return static_cast<int16_t>((static_cast<uint16_t>(rx[0]) << 8) | rx[1]);
}

