Keule/ZAI_GPS/ag-steer/src/hal_esp32/hal_impl.cpp
/// Read multiple raw samples and return the median value.
/// More robust than average against outliers.
/// @param samples  number of samples to read (should be odd for true median)
/// @param delay_ms delay between samples in ms (default: 5ms for 250 SPS)
static int16_t ads1118_read_raw_median(int samples, int sample_delay_ms = 5) {
    // Buffer for samples (max 31, enough for median)
    int16_t buf[31];
    if (samples > 31) samples = 31;
    if (samples < 1) samples = 1;

    for (int i = 0; i < samples; i++) {
        buf[i] = ads1118_read_raw();
        if (sample_delay_ms > 0) delay(sample_delay_ms);
    }

    // Simple bubble sort for small array
    for (int i = 0; i < samples - 1; i++) {
        for (int j = i + 1; j < samples; j++) {
            if (buf[j] < buf[i]) {
                int16_t tmp = buf[i];
                buf[i] = buf[j];
                buf[j] = tmp;
            }
        }
    }

    return buf[samples / 2];  // median
}

// --- Calibration persistence (NVS) ---

/// Load calibration from NVS flash.
/// Returns true if valid calibration was loaded.
static bool steer_cal_load(void) {
    Preferences prefs;
    if (!prefs.begin(NVS_NAMESPACE, true)) {  // read-only mode
        hal_log("SteerCal: NVS open failed");
        return false;
    }

    uint32_t magic = prefs.getUInt(NVS_KEY_CAL_VALID, 0);
    if (magic != NVS_CAL_MAGIC) {
        prefs.end();
        hal_log("SteerCal: no valid calibration in NVS");
        return false;
    }

    s_cal_left_raw  = static_cast<int16_t>(prefs.getInt(NVS_KEY_CAL_LEFT, 0));
    s_cal_right_raw = static_cast<int16_t>(prefs.getInt(NVS_KEY_CAL_RIGHT, 0));
    s_calibrated = true;

    prefs.end();

    hal_log("SteerCal: loaded from NVS (left=%d, right=%d)",
            s_cal_left_raw, s_cal_right_raw);
    return true;
}

/// Save calibration to NVS flash.
static void steer_cal_save(void) {
    Preferences prefs;
    if (!prefs.begin(NVS_NAMESPACE, false)) {  // read-write mode
        hal_log("SteerCal: NVS open failed, cannot save!");
        return;
    }

    prefs.putUInt(NVS_KEY_CAL_VALID, NVS_CAL_MAGIC);
    prefs.putInt(NVS_KEY_CAL_LEFT, static_cast<int32_t>(s_cal_left_raw));
    prefs.putInt(NVS_KEY_CAL_RIGHT, static_cast<int32_t>(s_cal_right_raw));

    prefs.end();

    hal_log("SteerCal: saved to NVS (left=%d, right=%d)",
            s_cal_left_raw, s_cal_right_raw);
}

/// Wait for user to press Enter on Serial monitor.
/// While waiting, shows live ADC voltage at 20 Hz (every 50ms).
static void wait_for_enter_live_adc(void) {
    uint32_t last_print = 0;
    while (true) {
        // Check for Enter key
        if (Serial.available()) {
            int c = Serial.read();
            if (c == '\n' || c == '\r') {
                while (Serial.available()) Serial.read();
                // Print one final value + newline to cleanly end the live line
                int16_t raw = ads1118_read_raw();
                float voltage = raw * 4.096f / 32768.0f;
                Serial.printf("   -> %7.3f V  (raw=%d)\n", voltage, raw);
                delay(50);
                return;
            }
        }
        // Print live ADC value every 50ms using \r to overwrite line
        uint32_t now = millis();
        if (now - last_print >= 50) {
            last_print = now;
            int16_t raw = ads1118_read_raw();
            float voltage = raw * 4.096f / 32768.0f;
            Serial.printf("   -> %7.3f V  (raw=%d)  \r", voltage, raw);
        }
        delay(2);
    }
}

void hal_steer_angle_begin(void) {
    // Ensure all other SPI device CS pins are configured as outputs
    pinMode(CS_IMU, OUTPUT);  digitalWrite(CS_IMU, HIGH);
    pinMode(CS_ACT, OUTPUT);  digitalWrite(CS_ACT, HIGH);

    // Wire up libdriver handle with ESP32 interface functions
    DRIVER_ADS1118_LINK_INIT(&s_ads1118_handle, ads1118_handle_t);
    DRIVER_ADS1118_LINK_SPI_INIT(&s_ads1118_handle, ads1118_if_spi_init);
    DRIVER_ADS1118_LINK_SPI_DEINIT(&s_ads1118_handle, ads1118_if_spi_deinit);
    DRIVER_ADS1118_LINK_SPI_TRANSMIT(&s_ads1118_handle, ads1118_if_spi_transmit);
    DRIVER_ADS1118_LINK_DELAY_MS(&s_ads1118_handle, ads1118_if_delay_ms);
    DRIVER_ADS1118_LINK_DEBUG_PRINT(&s_ads1118_handle, ads1118_if_debug_print);

    // Initialise driver
    uint8_t res = ads1118_init(&s_ads1118_handle);
    if (res != 0) {
        hal_log("ESP32: ADS1118 init failed (err=%u)", res);
        return;
    }

    // Configure: AIN0 single-ended, +/-4.096V, 250 SPS, ADC mode
    ads1118_set_channel(&s_ads1118_handle, ADS1118_CHANNEL_AIN0_GND);
    ads1118_set_range(&s_ads1118_handle, ADS1118_RANGE_4P096V);
    ads1118_set_rate(&s_ads1118_handle, ADS1118_RATE_250SPS);
    ads1118_set_mode(&s_ads1118_handle, ADS1118_MODE_ADC);

    // Try to load calibration from NVS
    steer_cal_load();

    hal_log("ESP32: ADS1118 configured (AIN0, +/-4.096V, 250 SPS, calibrated=%s)",
            s_calibrated ? "YES" : "NO");
}

bool hal_steer_angle_detect(void) {
    // Detection: try a direct raw read. If the value is not stuck at
    // 0x0000 or 0xFFFF (floating MISO), the ADS1118 is present.
    // Also discard 0x7FFF (all 1s in data, possible bus issue).
    int16_t raw1 = ads1118_read_raw();
    delay(10);
    int16_t raw2 = ads1118_read_raw();

    // A real ADC should return different values on successive reads
    // (noise) or at least a plausible value.
    bool looks_valid = (raw1 != 0 && raw1 != -1 && raw1 != 0x7FFF &&
                        raw2 != 0 && raw2 != -1 && raw2 != 0x7FFF);

    s_ads1118_detected = looks_valid;

    if (s_ads1118_detected) {
        hal_log("ESP32: ADS1118 DETECTED (raw1=%d, raw2=%d)", raw1, raw2);

        // Start continuous conversion mode
        uint8_t res = ads1118_start_continuous_read(&s_ads1118_handle);
        if (res != 0) {
            hal_log("ESP32: ADS1118 continuous start note: err=%u (using direct reads)", res);
            // Don't fail detection — we use direct reads anyway
        } else {
            hal_log("ESP32: ADS1118 continuous mode started");
        }
    } else {
        hal_log("ESP32: ADS1118 DETECT FAILED (raw1=0x%04X, raw2=0x%04X)",
                (unsigned)raw1 & 0xFFFF, (unsigned)raw2 & 0xFFFF);
    }

    return s_ads1118_detected;
}

