Keule/ZAI_GPS/ag-steer/src/hal_esp32/hal_impl.cpp
void hal_steer_angle_calibrate(void) {
    if (!s_ads1118_detected) {
        hal_log("SteerCal: ERROR — ADS1118 not detected, cannot calibrate");
        return;
    }

    hal_log("========================================");
    hal_log("  STEERING ANGLE CALIBRATION");
    hal_log("========================================");
    Serial.println();
    Serial.println("=== Lenkwinkel Kalibrierung ===");
    Serial.println();

    // --- LEFT STOP ---
    Serial.println("1) Lenkung ganz nach LINKS fahren (linker Anschlag)");
    Serial.println("   ENTER druecken zum Speichern des Wertes:");
    Serial.flush();
    wait_for_enter_live_adc();

    // Read 11 samples, take median
    int16_t left_val = ads1118_read_raw_median(11, 8);
    float v_left = left_val * 4.096f / 32768.0f;
    hal_log("SteerCal: left stop  -> raw=%d, %.3f V", left_val, v_left);
    Serial.printf("   Gespeichert: %7.3f V  (raw=%d)\n", v_left, left_val);
    Serial.println();

    // --- RIGHT STOP ---
    Serial.println("2) Lenkung ganz nach RECHTS fahren (rechter Anschlag)");
    Serial.println("   ENTER druecken zum Speichern des Wertes:");
    Serial.flush();
    wait_for_enter_live_adc();

    int16_t right_val = ads1118_read_raw_median(11, 8);
    float v_right = right_val * 4.096f / 32768.0f;
    hal_log("SteerCal: right stop -> raw=%d, %.3f V", right_val, v_right);
    Serial.printf("   Gespeichert: %7.3f V  (raw=%d)\n", v_right, right_val);
    Serial.println();

    // --- Validate ---
    if (left_val == right_val) {
        hal_log("SteerCal: ERROR — left == right (%d), no steering range!", left_val);
        Serial.println("FEHLER: Links und Rechts sind gleich! Nochmal versuchen.");
        Serial.println();
        return;
    }

    // Ensure left < right (swap if poti is wired in reverse)
    if (left_val > right_val) {
        int16_t tmp = left_val;
        left_val = right_val;
        right_val = tmp;
        hal_log("SteerCal: values swapped (left > right), poti wiring reversed");
        Serial.println("   Hinweis: Poti polaritaet automatisch korrigiert");
    }

    s_cal_left_raw = left_val;
    s_cal_right_raw = right_val;
    s_calibrated = true;

    // Save to NVS
    steer_cal_save();

    // Show summary
    int16_t span = right_val - left_val;
    float voltage_left  = left_val  * 4.096f / 32768.0f;
    float voltage_right = right_val * 4.096f / 32768.0f;

    Serial.println("=== Kalibrierung abgeschlossen ===");
    Serial.printf("   Links:  raw=%6d  (%.3f V)  -> -45.0°\n", left_val, voltage_left);
    Serial.printf("   Rechts: raw=%6d  (%.3f V)  -> +45.0°\n", right_val, voltage_right);
    Serial.printf("   Spanne: %d LSB  (%.3f V)\n", span, voltage_right - voltage_left);
    Serial.println();
    Serial.println("Werte im Flash gespeichert. Kalibrierung ueberlebt Neustart.");
    Serial.println("========================================");
    Serial.println();
}

float hal_steer_angle_read_deg(void) {
    if (!s_ads1118_detected || !s_calibrated) {
        return 0.0f;  // Not detected or not calibrated — return neutral
    }

    // Read raw ADC value directly (bypasses libdriver's config read-back)
    int16_t raw = ads1118_read_raw();

    // Map raw ADC to -45°..+45° using calibrated min/max
    int16_t span = s_cal_right_raw - s_cal_left_raw;
    if (span == 0) return 0.0f;

    // Normalise to 0.0..1.0 within calibrated range
    float normalised = static_cast<float>(raw - s_cal_left_raw) / static_cast<float>(span);

    // Clamp to [0, 1]
    if (normalised < 0.0f) normalised = 0.0f;
    if (normalised > 1.0f) normalised = 1.0f;

    // Map 0..1 -> -45..+45 degrees
    float angle = (normalised * 90.0f) - 45.0f;

    return angle;
}

bool hal_steer_angle_is_calibrated(void) {
    return s_calibrated;
}

// ===================================================================
// Actuator - SPI Bus 2 (FSPI / SPI2_HOST)
// ===================================================================
void hal_actuator_begin(void) {
    pinMode(CS_ACT, OUTPUT);
    digitalWrite(CS_ACT, HIGH);
    hal_log("ESP32: Actuator begun on CS=%d (stub)", CS_ACT);
}

bool hal_actuator_detect(void) {
    // Actuator is write-only, hard to verify by reading back.
    // Just verify the SPI bus works by attempting a transfer.
    sensorSPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
    digitalWrite(CS_ACT, LOW);
    uint8_t response = sensorSPI.transfer(0x00);
    digitalWrite(CS_ACT, HIGH);
    sensorSPI.endTransaction();

    bool detected = true;  // Stub: assume OK (actuator is write-only)
    hal_log("ESP32: Actuator detect: SPI %s", detected ? "OK" : "FAIL");
    return detected;
}

void hal_actuator_write(uint16_t cmd) {
    sensorSPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
    digitalWrite(CS_ACT, LOW);
    sensorSPI.transfer(static_cast<uint8_t>((cmd >> 8) & 0xFF));
    sensorSPI.transfer(static_cast<uint8_t>(cmd & 0xFF));
    digitalWrite(CS_ACT, HIGH);
    sensorSPI.endTransaction();
}

// ===================================================================
// Network - W5500 Ethernet via ESP-IDF ETH driver
//
// Uses ETH.begin() to initialise the W5500 on SPI3_HOST with the
// pins defined by the LilyGO board design.  The ETH driver handles
// SPI communication internally - no manual SPI setup needed.
//
// Link status and IP assignment are tracked via WiFi.onEvent()
// callbacks (ARDUINO_EVENT_ETH_CONNECTED / ARDUINO_EVENT_ETH_GOT_IP).
// ===================================================================

/// WiFi event handler for Ethernet events
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
static void onEthEvent(WiFiEvent_t event, arduino_event_info_t info) {
#else
// Arduino 2.x uses older event signature
static void onEthEvent(WiFiEvent_t event) {
#endif
    switch (event) {
    case ARDUINO_EVENT_ETH_START:
        hal_log("ETH: driver started");
        ETH.setHostname("agsteer");
        break;

    case ARDUINO_EVENT_ETH_CONNECTED:
        hal_log("ETH: link UP (%s %u Mbps)",
                ETH.fullDuplex() ? "full-duplex" : "half-duplex",
                ETH.linkSpeed());
        s_eth_link_up = true;
        break;

    case ARDUINO_EVENT_ETH_GOT_IP:
        hal_log("ETH: got IP %s  (MAC: %s)",
                ETH.localIP().toString().c_str(),
                ETH.macAddress().c_str());
        s_eth_has_ip = true;
        // Start UDP listener on AgIO port
        ethUDP.begin(AOG_PORT_AGIO);
        hal_log("ETH: UDP listening on port %u", AOG_PORT_AGIO);
        break;

